In [1]:
from pprint import pprint
import time
import requests
import pandas as pd
from config import rapidapi_key

## S&P 500

In [2]:
curr_time = int(time.time())
prior_year = curr_time-(60*60*24*365)
ticker_symbol = "^GSPC"

In [3]:
url = "https://apidojo-yahoo-finance-v1.p.rapidapi.com/stock/get-histories"

querystring = {"region":"US","lang":"en","symbol":ticker_symbol,"from":prior_year,"to":curr_time,"events":"div","events":"split","events":"earn","interval":"1d"}

headers = {
    'x-rapidapi-host': "apidojo-yahoo-finance-v1.p.rapidapi.com",
    'x-rapidapi-key': rapidapi_key
    }

response = requests.request("GET", url, headers=headers, params=querystring)

In [4]:
timestamp = response.json()['chart']['result'][0]['timestamp']
year_close = response.json()['chart']['result'][0]['indicators']['quote'][0]['close']
year_open =response.json()['chart']['result'][0]['indicators']['quote'][0]['open']
year_volume =response.json()['chart']['result'][0]['indicators']['quote'][0]['volume']
year_adjclose =response.json()['chart']['result'][0]['indicators']['adjclose'][0]['adjclose']

smpDict = {"Timestamp":timestamp,
           "Open":year_open,
          "Close":year_close,
           "Volume":year_volume,
          "Adjclose":year_adjclose
          }
smp_df = pd.DataFrame(smpDict)
smp_df

      Timestamp         Open        Close      Volume     Adjclose
0    1553261400  2844.520020  2800.709961  4237200000  2800.709961
1    1553520600  2796.010010  2798.360107  3376580000  2798.360107
2    1553607000  2812.659912  2818.459961  3266050000  2818.459961
3    1553693400  2819.719971  2805.370117  3372930000  2805.370117
4    1553779800  2809.399902  2815.439941  3158170000  2815.439941
..          ...          ...          ...         ...          ...
247  1584365400  2508.590088  2386.129883  7781540000  2386.129883
248  1584451800  2425.659912  2529.189941  8358500000  2529.189941
249  1584538200  2436.500000  2398.100098  8755780000  2398.100098
250  1584624600  2393.479980  2409.389893  7946710000  2409.389893
251  1584743502  2431.939941  2304.919922  1008955938  2304.919922

[252 rows x 5 columns]

## SSE Composite Index

In [5]:
ticker_symbol = "^SSEC"

url = "https://apidojo-yahoo-finance-v1.p.rapidapi.com/stock/get-histories"

querystring = {"region":"US","lang":"en","symbol":ticker_symbol,"from":prior_year,"to":curr_time,"events":"div","events":"split","events":"earn","interval":"1d"}

headers = {
    'x-rapidapi-host': "apidojo-yahoo-finance-v1.p.rapidapi.com",
    'x-rapidapi-key': rapidapi_key
    }

response2 = requests.request("GET", url, headers=headers, params=querystring)

In [6]:
timestamp = response2.json()['chart']['result'][0]['timestamp']
year_close = response2.json()['chart']['result'][0]['indicators']['quote'][0]['close']
year_open =response2.json()['chart']['result'][0]['indicators']['quote'][0]['open']
year_volume =response2.json()['chart']['result'][0]['indicators']['quote'][0]['volume']
year_adjclose =response2.json()['chart']['result'][0]['indicators']['adjclose'][0]['adjclose']

sseDict = {"Timestamp":timestamp,
           "Open":year_open,
          "Close":year_close,
           "Volume":year_volume,
          "Adjclose":year_adjclose
          }
sse_df = pd.DataFrame(smpDict)
sse_df

      Timestamp         Open        Close      Volume     Adjclose
0    1553261400  2844.520020  2800.709961  4237200000  2800.709961
1    1553520600  2796.010010  2798.360107  3376580000  2798.360107
2    1553607000  2812.659912  2818.459961  3266050000  2818.459961
3    1553693400  2819.719971  2805.370117  3372930000  2805.370117
4    1553779800  2809.399902  2815.439941  3158170000  2815.439941
..          ...          ...          ...         ...          ...
247  1584365400  2508.590088  2386.129883  7781540000  2386.129883
248  1584451800  2425.659912  2529.189941  8358500000  2529.189941
249  1584538200  2436.500000  2398.100098  8755780000  2398.100098
250  1584624600  2393.479980  2409.389893  7946710000  2409.389893
251  1584743502  2431.939941  2304.919922  1008955938  2304.919922

[252 rows x 5 columns]

## Dow Jones Industrial Average

In [7]:
ticker_symbol = "^SSEC"

url = "https://apidojo-yahoo-finance-v1.p.rapidapi.com/stock/get-histories"

querystring = {"region":"US","lang":"en","symbol":ticker_symbol,"from":prior_year,"to":curr_time,"events":"div","events":"split","events":"earn","interval":"1d"}

headers = {
    'x-rapidapi-host': "apidojo-yahoo-finance-v1.p.rapidapi.com",
    'x-rapidapi-key': rapidapi_key
    }

response3 = requests.request("GET", url, headers=headers, params=querystring)

In [8]:
timestamp = response3.json()['chart']['result'][0]['timestamp']
year_close = response3.json()['chart']['result'][0]['indicators']['quote'][0]['close']
year_open =response3.json()['chart']['result'][0]['indicators']['quote'][0]['open']
year_volume =response3.json()['chart']['result'][0]['indicators']['quote'][0]['volume']
year_adjclose =response3.json()['chart']['result'][0]['indicators']['adjclose'][0]['adjclose']

djiDict = {"Timestamp":timestamp,
           "Open":year_open,
          "Close":year_close,
           "Volume":year_volume,
          "Adjclose":year_adjclose
          }
dji_df = pd.DataFrame(smpDict)
dji_df

      Timestamp         Open        Close      Volume     Adjclose
0    1553261400  2844.520020  2800.709961  4237200000  2800.709961
1    1553520600  2796.010010  2798.360107  3376580000  2798.360107
2    1553607000  2812.659912  2818.459961  3266050000  2818.459961
3    1553693400  2819.719971  2805.370117  3372930000  2805.370117
4    1553779800  2809.399902  2815.439941  3158170000  2815.439941
..          ...          ...          ...         ...          ...
247  1584365400  2508.590088  2386.129883  7781540000  2386.129883
248  1584451800  2425.659912  2529.189941  8358500000  2529.189941
249  1584538200  2436.500000  2398.100098  8755780000  2398.100098
250  1584624600  2393.479980  2409.389893  7946710000  2409.389893
251  1584743502  2431.939941  2304.919922  1008955938  2304.919922

[252 rows x 5 columns]

## Covid19 Data

In [14]:
time_series_2019_ncov_Deaths =pd.read_csv("covid19_data/time_series_2019-ncov-Deaths.csv")
time_series_2019_ncov_Recovered = pd.read_csv("covid19_data/time_series_2019-ncov-Recovered.csv")
time_series_ncov_Confirmed = pd.read_csv("covid19_data/time_series-ncov-Confirmed.csv")
time_series_ncov_Deaths = pd.read_csv("covid19_data/time_series-ncov-Deaths.csv")
time_series_2019_ncov_Confirmed = pd.read_csv("covid19_data/time_series_2019-ncov-Confirmed.csv")
time_series_2019_ncov_Recovered = pd.read_csv("covid19_data/time_series_2019-ncov-Recovered.csv")

In [15]:
time_series_2019_ncov_Deaths.head()

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,3/11/20,3/12/20,3/13/20,3/14/20,3/15/20,3/16/20,3/17/20,3/18/20,3/19/20,3/20/20
0,NaN,Thailand,15.0000,101.0000,0,0,0,0,0,0,...,1,1,1,1,1,1,1,1,1,1.0
1,NaN,Japan,36.0000,138.0000,0,0,0,0,0,0,...,15,16,19,22,22,27,29,29,29,33.0
2,NaN,Singapore,1.2833,103.8333,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0.0
3,NaN,Nepal,28.1667,84.2500,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0.0
4,NaN,Malaysia,2.5000,112.5000,0,0,0,0,0,0,...,0,0,0,0,0,0,2,2,2,3.0

In [16]:
time_series_2019_ncov_Recovered.head()

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,3/11/20,3/12/20,3/13/20,3/14/20,3/15/20,3/16/20,3/17/20,3/18/20,3/19/20,3/20/20
0,NaN,Thailand,15.0000,101.0000,0,0,0,0,2,2,...,34,34,35,35,35,35,41,42,42,42.0
1,NaN,Japan,36.0000,138.0000,0,0,0,0,1,1,...,118,118,118,118,118,144,144,144,150,191.0
2,NaN,Singapore,1.2833,103.8333,0,0,0,0,0,0,...,96,96,97,105,105,109,114,114,114,124.0
3,NaN,Nepal,28.1667,84.2500,0,0,0,0,0,0,...,1,1,1,1,1,1,1,1,1,1.0
4,NaN,Malaysia,2.5000,112.5000,0,0,0,0,0,0,...,26,26,26,35,42,42,49,60,75,87.0

In [17]:
time_series_ncov_Confirmed.head()

,Province/State,Country/Region,Lat,Long,Date,Value
0,#adm1+name,#country+name,#geo+lat,#geo+lon,#date,#affected+infected+value+num
1,NaN,Afghanistan,33.0,65.0,2020-03-20,24
2,NaN,Afghanistan,33.0,65.0,2020-03-19,22
3,NaN,Afghanistan,33.0,65.0,2020-03-18,22
4,NaN,Afghanistan,33.0,65.0,2020-03-17,22

In [18]:
time_series_ncov_Deaths.head()

,Province/State,Country/Region,Lat,Long,Date,Value
0,#adm1+name,#country+name,#geo+lat,#geo+lon,#date,#affected+killed+value+num
1,NaN,Afghanistan,33.0,65.0,2020-03-20,0
2,NaN,Afghanistan,33.0,65.0,2020-03-19,0
3,NaN,Afghanistan,33.0,65.0,2020-03-18,0
4,NaN,Afghanistan,33.0,65.0,2020-03-17,0

In [19]:
time_series_2019_ncov_Confirmed.head()

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,3/11/20,3/12/20,3/13/20,3/14/20,3/15/20,3/16/20,3/17/20,3/18/20,3/19/20,3/20/20
0,NaN,Thailand,15.0000,101.0000,2,3,5,7,8,8,...,59,70,75,82,114,147,177,212,272,322.0
1,NaN,Japan,36.0000,138.0000,2,1,2,2,4,4,...,639,639,701,773,839,825,878,889,924,963.0
2,NaN,Singapore,1.2833,103.8333,0,1,3,3,4,5,...,178,178,200,212,226,243,266,313,345,385.0
3,NaN,Nepal,28.1667,84.2500,0,0,0,1,1,1,...,1,1,1,1,1,1,1,1,1,1.0
4,NaN,Malaysia,2.5000,112.5000,0,0,0,3,4,4,...,149,149,197,238,428,566,673,790,900,1030.0

In [20]:
time_series_2019_ncov_Recovered.head()

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,3/11/20,3/12/20,3/13/20,3/14/20,3/15/20,3/16/20,3/17/20,3/18/20,3/19/20,3/20/20
0,NaN,Thailand,15.0000,101.0000,0,0,0,0,2,2,...,34,34,35,35,35,35,41,42,42,42.0
1,NaN,Japan,36.0000,138.0000,0,0,0,0,1,1,...,118,118,118,118,118,144,144,144,150,191.0
2,NaN,Singapore,1.2833,103.8333,0,0,0,0,0,0,...,96,96,97,105,105,109,114,114,114,124.0
3,NaN,Nepal,28.1667,84.2500,0,0,0,0,0,0,...,1,1,1,1,1,1,1,1,1,1.0
4,NaN,Malaysia,2.5000,112.5000,0,0,0,0,0,0,...,26,26,26,35,42,42,49,60,75,87.0